{  "articles" : [
        { "type":"articles",
            "title":"So_what_about_Death_Stranding",
            "subtitle": "Genius masterwork or pretentious crap? ",
            "conclusion": "Yes, it is the real deal. Okay it didn’t send a ripple of life altering creative destruction throughout the entire games industry, altering the medium forever and kicking off a new era of new videogames, but, but then again I’d say that was an unrealistic expectation anyway. But it did deliver a truly fresh and interesting gameplay behind the concept of the “social strand” game. Most notably the idea that the challenge is in traversing the world itself rather than in fighting enemies, and in the indirect interactions with other players helping each other are cool and rewarding features. With the typical Kojima style of storytelling and character design on top of that this game is indeed a masterpiece (be it maybe less so than the almost biblical hype surrounding it) and it does bring a beautiful, immersing and inspiring experience.  Really worth looking into.",
        "name": "So what about Death Stranding?",
        "intro": "Love it or hate it, but Death Stranding is one of the most attention grabbing games of the year 2019 for sure. From the first trailer up until very close to release date (and for many people after that still) this game has been surrounded by hype, mystery and wtf. According to Kojima fans it would turn out to be an innovative creation of genius that would introduce a new genre and change the gaming game forever. At the time of writing I haven’t finished it so this is not a review, but it’s more of an article on the game in the light of it’s hype and divisiveness. ",
        "images": [[{"title": "ds1", "text": "Cliff is one of the coolest characters on the PS4"}, {"title":"ds2", "text": "This little guy will be your new best friend"}, {"title":"ds3", "text":"In MGS style artwork, the characters look like classic Kojima "}], [{"title": "ds2.1", "text": "My dude Sam chilling in the pivate room"}, {"title":"ds2.2", "text": "This is where the game got real for me"}, {"title":"ds2.3", "text":"The world is impressive, like this voidout crater here"}]],
        "text": [["Early on in the days where there was nothing but short trailers featuring a baby in a pod Kojima mentioned the rope and the stick. Mankind’s first inventions: one to hit whatever you don’t like, and the other to keep whatever you do like with you. At the time that was an “uuuuuhm, okay…? ” kind of explanation concerning the gameplay. And then it came out and it turned out that you do actually carry stuff from one place to another. Of course there’s lots of complications and many more features but in the most basic sense that really is what you actually do in the game. \\nThen there’s this mission early in the game where you have to carry the corpse of an important person to an incinerator on a mountain (when you play the game you’ll know why a dude needs to carry a corpse to an incinerator on a mountain) and at some point this emotional music (which I usually hate)  starts to play while you are making your way over these empty hills and at that moment the feeling of this game just clicked and I knew I was going to love it. It has this same feel of dramatic rebuilding of civilization in the wasteland, similar to for example Fallout games but in a different way. Soon you realize it’s not really about delivering stuff, but it’s about building connections between people and seeing the connected territory expand.  Slowly rebuilding Kojima’s version of the USA does feel very rewarding. "],
        ["The game is very cinematic and atmospherical, especially when playing with headphones and hearing the rain fall on your had.  The pull of the game is intense, and you will grow attached to the little baby in the yellow pod you carry with you and you will feel intrigued and strangely endeared by flashes a man played by Mads Mikkelsen trying to be a good dad for it. The music fits the theme and general style very well and I remember seeing an interview with Kojima some months before the release in which he mentioned that you can rest in your own private room and that it’s really cool and I had to laugh because I thought it didn’t sound cool at all. Silly Kojima. But now I think it is. Putting on your favorite in-game song while watching Norman Reedus drinking a beer in his subterranean private room after hauling along 200+ kg’s of cargo through rough terrain feels just feels cozy.\\nSome of the early criticisms I have seen is that the big open world is so empty. And in some ways this is true. There’s few enemies who are usually found in certain spots only, or there’s little in terms of items to pick-up, NPC’s, towns or whatever; the world is indeed a mostly empty natural world. Surprisingly, this is exactly not boring and very nice for a change. I was actually growing somewhat tired of having an open world game and constantly having the urge to check out every corner, look around for every conversation and do all the side-quests and find hidden items everywhere, and in Death Stranding there’s no need to do these things. The sooner you can get from A to B and just arrive where you want to go without detours, the better. I found this to be strangely liberating. \\nThe enemy, or rather the challenging element to conquer with your wits and skills, is the territory itself. If you are like me you will first run into the old habit of still beelining towards every objective, stubbornly mashing the climb button on steep cliffs, falling over & damaging your cargo a few times before you realize that it doesn’t work like that in this game. And then you will actually start out by examining the map, and looking around every so many meters to see whether your approach makes sense, and you will be arguing internally whether you should place that ladder now or take the long route and keep the ladder in case you need it later. Safely reaching your destination does feel good every time. Later on you will be able to build some structures (like a watchtower or a shelter) and even roads in the world. "], 
          ["The game’s most interesting feature however is the indirect multiplayer element. You will never encounter another player, but you can leave signs for others and most importantly you will be able to use some of the structures built by others in the world. It is unknown to me exactly what determines what structures from what players you can see, but as soon as you connect an area to the “chiral network” (this is a central element the game’s story progression, basically a sort of internet+ that places need to be connected to) you will start seeing signs and structures. And you can like them (as in, social media-style like).  \\nIt might feel a bit weird at first, but by the time I built my first road and seeing thousands of likes pouring in from player who travelled on them I realized that this is the game’s most rewarding aspect. It’s really cool to both use things left for you by your internet bros who you don’t know and sending out some likes, and also to leave stuff in the right places to make life easier for them as well. You’ll not just looking around to see how you are going to get through an area, but also to see where you might construct something that will be the most useful for others.  Laying down a zip-line which connects to other ziplines made by online players and thus creating a network that saver everyone a shitton of time feels amazing. "]]},
        { "type":"articles", 
            "title":"state_of_the_games_industry",
            "subtitle": "Can there be too much?",
            "conclusion" : "Very simplistically speaking, there’s a trend of ever increasing budget and effort into developing games with an overall increase in production value and quality as well on the one side, and a slower increasing pool of consumer money that’s spent. Most growth is in mobile games but my guess is that it’s a LOT of small transactions spread out over a LOT of games so it’s harder for a single company to make serious profits on a high-end product from that. Should we be worried for an incoming crash in the videogame industry? And if so, what needs to be done to make sure the development keeps going strong? Should we spend more on games by choice,  just how for example people choose to spend more on biological food to support their idea of sustainable food? Maybe. For example, imagine paying slightly more (as in standard price geos up), for more fleshed out yet at the same time on average shorter games. It’s in essence happening anyway, almost every game has some form of DLC (cosmetic or not) now so you’d basically be canceling that out. It’s rather pay say, max. 5-10% more on a game that is complete than the paid DLC every 3 months & pass model becoming the norm. And in all honesty, considering how much the quality of both  in- & output of the industry has grown (and also how much basically everything in life is getting more expensive all the tie anyway) it might even be all right to do so.  ",
            "name": "State of the games industry",
            "intro": "I remember back when I’d get a SNES game and there’d be these games in the shop, and some of them were just garbage. You needed to be careful with your pick. In the NES era, even a lot of them were. From the N64 throughout Xbox 360/PS3 I remember times where I had finished more or less all the greatest games I wanted to play and was sometimes waiting for the next truly great game to come out. Nowadays there are just so much great games coming out it’s impossible to keep up. At the same times, the amount of money into developing games is huge and worthy games are deemed “flops” after release, with sales figures which are actually pretty big. Is the market just too crowded? ",
            "images": [[{"title": "state1", "text": "RDR2. Truly amazing. Also very long"}, {"title":"state2", "text": "Backlog pain: haven't even played Witcher 3 yet."}, {"title":"state3", "text":"Another one I was excited for but had to pass on"}], [{"title": "state2.1", "text": "Then again I did put like 220 hours in Fallout 4"}, {"title":"state2.2", "text": "Videogame market size still growing overall"}, {"title":"state2.3", "text":"Dutch game studio Guerilla Game Studios"}]],
             "text": [["When I started to write this article, I was feeling some positive game stress because I need to juggle around finishing Red Dead Redemption 2, Death Stranding and the Star Wars Fallen Order before Final Fantasy VII Remake & Cyberpunk 2077. Preferably even one of my more esteemed backlog games as well.  Like Nier or the Witcher 3. I knew I would get lost and sucked in for 100+ hours  after starting the Witcher so I have postponed it. But then I just realized that Dragon Ball Z Kakarot is coming out as well in about a week. Oh, the agony! \\nSeriously though, it does feel bad to have an ever increasing backlog with real good games on there, and never being able to finish most of them before the next great game comes along. The industry has reached a point of maturity and professionalism which is impressive. The quality standard is just so high. I am nearing completion of Red Dead Redemption 2 and just for background sake I searched some gameplay videos of Red Dead revolver, and it is such a huge different in terms of what the medium can accomplish. And it’s not just the technology and the graphics, but also just having reached a higher level of mastering the artform of game creation, and of capital and effort pumped into it. It is glorious and Red Dead Redemption truly reached a new level of gaming greatness. "],
             ["Yet it can also a bad thing at the same time and there might be trouble. Of course in part it’s personal, as for example I make myself finish every game I play while normally I guess it would be okay to abandon one if something else comes along that grasps your interest more. I guess you could also look at it something like “well you just have a certain amount of time o play anyway, so you just play what you feel like playing the most in that time and if you have more choice than that’s just nice”. In a way there’s nothing wrong with a lot of great games being there. Retirement is going to be awesome! But a lot of great expensively produced games also need a lot of consumer money spent buying them. \\nThe biggest of my concern is one of whether the market can sustain this level of quality and investment over time. What I mean is the following. Of course it is only good that there are so many great games being produced, and it is an extreme luxury position that there are too many good games out there to buy (let alone play) them all. But what worries me is that there’s also games that don’t sell so well, while they in every way would normally deserve to do so. I am a 30-something with a decent job etc. who loves videogames, so if I can’t contribute my share to infusing the videogame market with happy costumer cash, who can? Common sense would say that people with jobs (let alone wives & kids) don’t have that much time to play games, while people without jobs don’t have so much money. Is there a gap? This might be exactly why so many producers are desperate to tap into new markets, and making desperate efforts to appeal more to the less traditional gaming audience like “girl gamers” or LGBT community. I am somewhat skeptical of the long-term value of this strategy. "],
             ["What might need to happen instead( as unpopular as it might sound to some) is a shift to slightly more expensive and shorter games. Hear me out as it might be a good idea. This would of course be very different back in the years where as a child I’d get 3 games a year: one for my birthday, one in the holidays and my allowance could buy me about one a year as well. But honestly, the limit on my videogame spending is not money itself but the amount of time I have to play and finish games. I’d easily spend 3-4 times as much on games if I knew I could finish at least 3 out of 4 that I’d buy. And I know that most people around their 30’s who play games feel the same.\\nI think God of War is a good example in that it makes a qualitatively amazing and enjoyable game, but unless you are an extreme completionist you’ll finish it in around 30 hours. But me and many others gladly paid it’s price for the experience it offered. As long as the content is really good and the experience of the game is awesome it’s not a good thing per se that it’s long. Besides, for a lot of people who have been playing games for decades there’s some side-quest and collectibles fatigue kicking in.  The sooner you can move on, the more games you can play and the more money will be flooding into the business. And this needs to happen, at least this way it is for qualitatively high content and not through loot boxes or paid cosmetics. Another thing I’d like to see experimentation with is a facilitated way to “tip” games, like for example being able to quickly donate some money extra through PSN. (which of course would need to fly right past the publishers to the devs themselves). "]]},     
        {"type":"reviews",
        "title": "Dragon_Quest_XI",
        "subtitle": "As classic JRPG as it can get",
        "name": "Dragon Quest XI",
        "intro": "When Dragon quest XI released, it was the first game I got and immediately started playing on day 1 in a long while. I love Dragon Ball and Toriyama’s artstyle, and I remember playing the shit out of Dragon Warrior Monsters and some Dragon Warrior game (I think 2?) on the Game Boy Color in my teens so I was hyped since seeing the first beautiful footage released of this. So I unpacked it, enjoyed that delicious new game smell, made some coffee and started a glorious day of playing my new game.",
        "score": "8.4",
        "conclusion": "Even though I must admit that around the 85 hour playtime mark there was a short while where I though “okay I’m ready for this game to end now” this lasted only shortly and when I did actually finish it I felt about sad about that. It was a beautiful journey, starting as a nobody with shitty equipment, through excitedly visiting the capital for the first time, getting the JRPG classic boat, later on flying whale-thingy all the way to being the full-fledged chosen one with superstring end-game equipment, stats and attacks. The turn-based gameplay, exploring, questing is all very good but the best thing is just the general feeling of following the adventure in this beautiful world, enjoying the excellent visuals, art style and music (yes I liked it, even when it never stopped). \\nThe pace is somewhat slow and could be higher. And I’m not talking about the cutscenes since that’s kinda part of the genre but I’m talking the pacing of the game. The rate at which the more interesting game mechanics, special skills and difficulty increase are introduced could be higher. However, the sheer beauty and magical vibe of the game easily compensates for this. And late in the game you will need to make use of the most elaborate crafting and combat mechanics of the game to beat the end-game bosses. Stick through these moments when it feels a bit too slow and you’re appetite for this game will soon be revitalized in the game’s next phase.\\nDragon Quest XI is a glorious return of a fan favorite, one of the best games on the PS4 (and Switch) and an absolute must play for anyone who likes (J)RPG’s. And it does definitely show that the JRPG genre hasn’t per definition aged bad and that they can adapt to the current gen and be great. ",
        "gprating": 3.5,
        "strating": 3.5,
        "imrating": 4.0,
        "virating": 4.5,
        "images": [[{"title": "dq1", "text": "Your compagnons: you will be attached to them"}, {"title":"dq2", "text": "Battles are classic JRPG and look good "}, {"title":"dq3", "text":"Exploring the world feels magical"}], [{"title": "dq2.1", "text": "Doing well at crafting imporves item quaility"}, {"title":"dq2.2", "text": "Unlock costumes to suit your style"}, {"title":"dq2.3", "text":"Multi-character pep attacks are exciting to see"}]],
        "text" : [["The game is incredibly old school JRPG from the start, including a starting mission where you’re armed with a stick and need to find your native village rascal who went in some cave with monsters. But as soon as you walk up a mountain you notice that it looks really good. Obviously the graphics are technically less impressive than the real lookers like Red Dead Redemption 2, but the style itself does look amazing. As far as cell-shaded style graphics go this is the best you’ve ever seen for sure. Seeing this Toriyama style within the beautiful green world was amazing from that first mission on. The game’s presentation is spotless, from intuitive UI’s to the cutscenes and music and the gameplay is very solid  JRPG with a classic turn-based battle system. And I mean really solid JRPG. It has you climbing up from dealing 3 HP damage per hit, to slowly getting some simple special attacks to eventually unlocking impressive skills and magical attacks late I the game. While somewhat slow, it’s also nice because you will appreciate every new move and every step in your character growth more. \\nThe story is also slow, but I my opinion this is cute and endearing rather than annoying. There’s attention to detail and emotional fleshing out of the characters and the world. Sometimes it’s ludicrous elements can get a bit too much for me, like the son of the sand empire’s ruler being basically a complete faking useless douche, in general I do really like the pacing and the way in which the story unfold. And it does feel like you are really swept away on and adventure, sometimes choosing your own pace and sometimes being propelled forwards by events beyond your control. There’s side-quests and exploration is worthwhile as hidden items, crafting materials and chests can be anywhere."],
             ["You control a party of max 4 characters in battle, and in typical JRPG fashion the party members are unlocked In the game through story progression. The character design, in line with the graphical quality of the game is spot on. The main characters will grow on you and they’re all memorable. The ones that made the most lasting impression on me are for example  Jade who is basically a hot martial arts woman and Sylvando who has some traits of a flamboyant homosexual probably the most noteworthy ones. But they are all great, design and character wise. There’s alternative costumes which look cool as well so you can put your characters in your favorite style. And in it’s entirety my favorite part of playing this game was the feeling of really being in this magical, beautiful world. \\nBut it’s also really good gameplay wise. Dungeons are generally well-designed, barring a few annoying ones (which also belong in a RPG), usually long enough and with enough branches to be interesting but not big and complicated enough to feel like exploring is a chore. Every character has a style broadly fitting RPG archetypes (mage, healer, thief etc. ) but each character also has different kinds of weapons which can dramatically change their style. The thief Erik for example can handle sword or knives, but also boomerangs which always deal (usually less) damage to all enemies. There’s room for variation and different builds; different characters have healing skills and there’s a variety of buffs and debuffs as well to strategize with. You probably don’t need to many elaborate strategies for most of the game but you will at the end game. Besides the character’s unique skills, there an overdrive mechanic which allows for different kind of super attacks, which can combine with different characters for extra strong ones. They look cool and also adds another layer of team building. "], 
             ["My only issue with the game is that in a certain way it is so slow. I’m not talking about the story or the amount of gameplay as a typical JRPG pace is part of the genre but the game is also slow in introducing both difficulty and the more in-depth game mechanics. Most of all, some of the more interesting role-specific abilities get unlocked really late in the game (and it is a long game!), which is kind of good because it means you will still be unlocking worthwhile abilities end-game too but it is bad because it means you will be able to experiment the more interesting team builds quite late. Likewise the game is really slow to introduce new mechanics, almost to the point where the first whole third of the game is in some ways the tutorial (and we’re talking a 100+ hour game. There’s a genuinely good and fun crafting mechanism, but unfortunately you have to get pretty far into the game to really be able to make a nice variety of really useful items.\\nSome people hate the fact that the music plays non-stop: it goes from field tune to battle tune to town tune to field tune to dungeon tune to field tune, but a small variety of songs plays all the time. And it is typical Dragon Quest music which I guess can be it or miss, but I didn’t mind. Reminded me of the old days (which is probably exactly what it’s supposed to do). And anyway it is a solid qualitatively high JRPG soundtrack. What did annoy me however, was the fact that enemy battle cries are in these  8-bit sounds I remember straight from Dragon Warrior Game Boy games. It’s a cute thought but for me this does distract a bit and lessens the immersion.\\nThe overall quality, beauty and thorough polish and detail of the game does make up for it all and even when slow I regularly found myself just looking around at the world, the town and the characters. The main quest is long, even for a JRPG and will definitely surprise you. There’s good end game content as well, including some very difficult optional bosses and literally tons of collectable items, including alternatives costumes. "]]},
        {"type":"reviews",
        "title": "Fallout_76",
        "subtitle": "Nice try, but no",
        "name": "Fallout 76",
        "intro": "Man, this game makes me sad. I will confess two things right away: first I am heavily influenced by the fact that I absolutely loved Fallout 4 and thus was really excited for a next installment of the franchise form that point of view, and second I did not finish the game. I usually think you should never review a game you haven’t finished but in this case it’s also part of the story. I respect the courage behind a daring move but the result did not make me happy. The basics for greatness are all there, so what went wrong?",
        "score": "6.2",
        "conclusion": "They really should’ve added a step in between Fallout 4 and 76 of introducing player interaction, f.e. by keeping the building mechanics of 4 intact but adding the ability to trade with other players, or even send raiding parties to their settlements. But removing NPC’s and settlements fully and “replacing” it with multiplayer mechanics is in my opinion a huge mistake which kills what should’ve been a top 5 PS4 game for me. And maybe after that add some feature of being able to really interact with players, or visiting other’s players world and from there see. But to completely change course like this is in my view a big mistake. \\n I was legit sad and surprised how they could something which was so good (Fallout 4, but 3 and New Vegas as well) to ruining so many of the great features.  The bold move by Bethesda completely misses the mark for me, but I am happy for the people who enjoy it. There’d better be a proper Fallout 5 soon though. ",
        "gprating": 2.5,
        "strating": 1.5,
        "imrating": 2,
        "virating": 3,
        "images": [[{"title": "f761", "text": "The games Vest Virginia sure  looks inviting!"}, {"title":"f762", "text": "The world map itself is awesome as well."}, {"title":"f763", "text":"This shit look cool, I was hyped."}], [{"title": "f762.1", "text": "Gotta love them Fallout upgrade screens."}, {"title":"f762.2", "text": "\"Scorched\", lame-ass enemies. Where's my raiders?"}, {"title":"f762.3", "text":"Player & base customization in itselfs is great. "}]],
        "text": [["When it was about to come out, I was so excited that I took a day off to enjoy it. I got it early, had snacks ready and was bouncing around all the time during the install. Then the game started up and I though “Hell yes, Fallout time!!!”. As soon as I saw the title screen with some destroyed playground, and the character creation procedure I was feeling it. The game kicked off in the vault with the classic Vault Boy cartoons explaining things about surviving in the wasteland and I was full on hyped. Stepping outside, fighting the first few shit tier enemies with a knife, grabbing some edible herbs and playing some banjo in an abandoned watchtower, I was in the clouds. This lasted for about 4 hours, sadly. \\nThe basic gist of the game is to (once again) survive in the postapocalyptic wasteland, this time in West Virginia. In case you’re not familiar with Fallout, it’s an open world RPG and everything is in real time. The setting is basically my favorite setting ever as it is a really cool fictional futuristic 1950’s USA. There is something amazingly nostalgic about walking around these destroyed remnants of the true American Dream with some Nat King Cole (or similar) on the radio. And Fallout also has one of my most appreciated RPG character development schemes, with both stats and perks which really allow you to grow a character and a play style you identify with. The main difference is that 76 goes full Online Multiplayer, even to the point that there are no NPC’s at all. Big mistake."],
        ["It probably is unfair in a way that I judge this game so much by what is it is not. In a way it is precisely because I love Bethesda’s former work so much that I loathe this one. Of course there is good things to be said about 76 as well. As I said, the world and style itself is still classic Fallout and thus great.  The character creation as well as the photo mode are great. The perk system is classic fallout even though the worse multiplayer gameplay makes it feel less impactful. The system with cards is cool though. The crafting system improved, as you can make and upgrade weapons, armor and various items like explosives this encouraging you to always look for scrapable material or items.\\nThe biggest problem is that a few hours in, you realize that everyone is dead anyway and you will never find a vibrant hub filled with interesting characters, side -quests and allies but that you will be chasing trails to dead people the whole time. For me such a big part what makes Fallout so great is that when exploring you never know who you’ll find where and what will happen. In any cave you can stumble on a raider group, there’s towns with different societies and you will make many interesting friends and enemies. Not in this game you won’t. I have the feeling that it’s not just the multiplayer part which makes it bad, but also the lore and world are off in a way. The scorched as main enemies are  super lame, especially taken into account that there are no raiders or other human enemies. This is too bad because it does look like Fallout 76 actually adds more and some cool animal-like enemies to the mix. "], 
        ["Another issue I have with this game: it’s very clunky. The shooter gameplay in Fallout has never been that great, which was completely fine because it was more about using the V.A.T.S. system rather than shooting in real time (it’s a time stopping ability which lets you target specific enemy parts; the RPG way of combat in Fallout). They removed the time stopping power because obviously that’s impossible in a multiplayer game, but they haven’t fixed the combat for real-time battles only. The last time I played the game determined to give it another shot and to enjoy it, I quit at some point because a standard battle was just too janky too enjoy as the enemies were glitching all over the place. And that’s more then a year after launch. How I longed to place a well-aimed headshot in V.A.T.S. in prior Fallout games and watching the head fly off in slow motion… but that’s gone too.\\nWhile the build and grow your own camp addition is cool in and of itself there is again a big problem. It replaces something which was way better. First of all moving it is a pain in the ass because it an block if the terrain is even slightly different (which it basically always is). But even more, it’s kinda lame to just build a camp in a dead world. And nothing happens when you’re out f the game: no attacks, raids or economy. Everything is dead. My favorite part of the Fallout 4 building was seeing settles come in, building a trade network, coming back to see that they have fended off some attacks in my absence. In the end game you could even grind for legendary loot by increasing the difficulty and having more regular, really hard enemy attacks on settlements and thus making it worthwhile to get good equipment for all defensive settlers. All gone as well.\\nI was also just mad when I found out that the conquerable workshops (i.e. places where you can build stuff and get resources after you conquer them) stop being yours when you stop playing. This feels so contrary to the idea of a game where you build things and create your place in the world. Wtf man so I conquer it, build some stuff, defend it once, and if I stop playing say 1,5 hour later I lose it and did all that for a negligible amount of resources gained? Yo mama Bethesda. I want to make defenses that keep up (or not) in the face of attacks while when I’m not playing, see what’s left when I’m back. This is just bad execution of a good idea. "]]
        },
        {"type":"reviews",
        "title": "Yakuza_0",
        "subtitle": "Streetfights, karaoke & hostess clubs",
        "name": "Yakuza 0",
        "intro": "I came in completely fresh, having shamefully ignored the franchise before just because based on some images I dismissed it as some Japanese GTA imitation. I wasn’t just normal wrong, but it’s a completely different kind of game. A unique kind of game I dare say. Very strange, but awesome. And it turned out to be one of my favorite games I’ve played on the PS4. Unless you absolutely hate Japanese humor you should play this.",
        "score": "8",
        "conclusion": "This game is very strange, but in a good way: it had been a while since I played something that really felt lke a different genre. I gave it a try with some doubts but I came back a fan of the series and finished Yakuza Kiwami afterwards and I’ll soon start Kiwami 2 and the rest. I just love it’s typical Japanese mix of emotional storytelling with absurd and sometimes pervy humor. All in a really fun game with unique combat and solid action ROG mechanics.\\n The combat is simple yet interesting due to the different styles you can instantly switch too, and it gets challenging enough in the late game  & bosses. It gets better the more you choose to play in a way that you uses stylish moves for entertainment rather than just cheese battles. The RPG elements bring a solid feeling of progression and character growth, and the game has a LOT of optional content. I grinded to unlock all the special moves, hostesses, super rare weapons and just big money with pleasure. \\n But most of all, the style and general vibe of the game is why you should play it. The storytelling, setting and presentation is really good. The characters are awesome and you will feel heavily invested. Majima, Kuze & Kiryu are some of the most memorable characters of my PS4 time period. If you are able to look past the rough edges in the game world's details and the simple base of the combat you’re in for a gem of a game.  ",
        "gprating": 3.0,
        "strating": 4.0,
        "imrating": 3.5,
        "virating": 4.5,
        "images": [[{"title": "yakuza1", "text": "Heat actions look awesome"}, {"title":"yakuza2", "text": "Use the environment to bash enemies"}, {"title":"yakuza3", "text":"The fighting is simple but good"}], [{"title": "yakuza2.1", "text": "Sometimes it does feel like Japanese Vice City"}, {"title":"yakuza2.2", "text": "Be a true balla getting money from your club"}, {"title":"yakuza2.3", "text":"Unlock skils using money in this good-looking grid"}]],
        "text": [["As soon as the opening theme kicked in and the introductory cutscene ended I was hooked. The character design looks really good and the stage set by the music and art style is spot on.  But I still didn’t really know what exactly I’d be playing in a moment. Basically, what you can expect when you start playing yakuza 0 is an action RPG in a very engaging Japanese mafia (i.e. Yakuza) story. Set in the 80’s. The plot revolves around an organized crime war breaking out over the ownership an empty pace of ground that is the key to a huge government sponsored construction project. It’s well written and brought and you will be sucked in. The game is also very funny also full of typical absurd Japanese humor. For me the game’s strongest point is the weird mix of sometimes tear-jerking, merciless mafia story and the comical greatness where I actually laughed out loud  at times. The design and music are great and there’s definitely some memorable tunes on the OST like Kuze’s theme or Two Dragons. \\n The combat is all real-time but it’s RPG genre here shows in that the most important part of the combat is unlocking the moves and stat bonuses that fit your style, rather than mastering a fixed set of moves available from the beginning. Both playable characters have 3 different martial art styles which are unique with each it’s won strength and weaknesses. Enemies use different styles as well and it works; as your skills grow you will feel awesome switching around at the right time, using a defensive fast dodge style to evade some attacks early on, switch to the offensive Beast style to deal heavy damage to the nearest enemies and then back to dodge until you are at safe distance. The coolest thing about it are the so called “Heat” attacks, which require usage of a meter and allows for a very wide variety of special attacks which look awesome. The AI is rather dumb which shows especially when fighting groups of enemies as they’ll basically just do their own thing without coordination. While this could be better it’s not too bad for the kind of combat this game offers. "], ["The flow of the game has you roaming free in the game’s main hub, either the Kamurocho district of Tokyo (based on the real Kabuchiko going-out district), or Osaka based on your progress in the game. It is actually quite small, but to me it didn’t really feel like that until late in the game. Probably because you’ll steadily unlock new venues and scenes. You will be free to roam around, explore and find & do side-quests in between the story missions which are usually marked on the map. Aside from the side-quest there are phone cards to collect, random battles and Mr. Shakedown battles (a string buffed guy who will fight you to take your money if you run into him). The side-quest are not only funny, but they grant you worthwhile rewards as well like new hostesses for you club, weapons or upgrades. The story is well written and gets pretty deep with twists and emotional moments. The story advances in chapters and seeing your amount of cash grow, as well as expanding your move set and combat abilities does offer a nice feeling of progression.\\nThere’s tons of mini-games, including karaoke (Kiryu singing Baka Mitai will be in your head for life), arcade games, betting scantily clad women who are wrestling and especially two more important ones: managing a hostess club and managing a real estate firm. These are more fleshed out, offer more rewards and are integrated in the story. Especially the hostess club one can be strangely addictive. It’s really up to you whether you want to rush through the storyline, or whether you will indeed explore and take on the various challenges: there’s a fishing mini game, an arena, you get rewards for eating all the different foods and so on. While I did enjoy most of these things while playing this game, I honestly did enjoy most of these things slightly less in Yakuza Kiwami when I played it afterwards because they are very similar. So my guess is you will get to the bottom of it for sure in the first one you play, but you might leave some of it when you move to the next one. But the game is anyway great content-wise."], ["On a more critical note, the game can feel a bit messy sometimes as it is not always clear when a side-quest will be available somewhere or when doing a story mission will make a side-quest unavailable. Awesome and funny as most the side-quests are, sometimes it feels very out of place to be busy grabbing a kid an adult magazine from a vending machine in between the life-and-death drama of the main story. Most of them are funny and have some battles, but there’s also some uninteresting fetch quests among them. Besides, the character design is great but the world is sometimes a bit rough, especially the inside environments can look kinda bland and unpolished.\\nSome people complain about the combat being too simple and basically just charge up and spam your best special attack whenever you can, but I wouldn’t agree. I mean sure I’ve mindlessly Beast-styled my way though many a random street battle, but it’s a player’s choice to finish these battle’s in a stylish way if you’re curious to see all the special attacks. I went out of may way to do this, especially with the contextual ones which use objects (for example an electrical cooking plate) and it is rewarding to finish a battle with maybe some unnecessary effort, but a mad stylish finish. Besides, the boss battles require you to strategize and fight well by altering dodging styles, stun attacks and high damage styles to survive and chip away their health. And especially later in the game the story battles where you’re more outnumbered are also no cake-walk and I found myself being grateful using some of the rarer weapons I was grinding for. "]]}
    ]
}