{  "articles" : [
        { "type":"articles",
            "title":"So_what_about_Death_Stranding",
            "subtitle": "Genius masterwork or pretentious crap? ",
            "conclusion": "Yes, it is the real deal. Okay it didn’t send a ripple of life altering creative destruction throughout the entire games industry, altering the medium forever and kicking off a new era of new videogames, but, but then again I’d say that was an unrealistic expectation anyway. But it did deliver a truly fresh and interesting gameplay behind the concept of the “social strand” game. Most notably the idea that the challenge is in traversing the world itself rather than in fighting enemies, and in the indirect interactions with other players helping each other are cool and rewarding features. With the typical Kojima style of storytelling and character design on top of that this game is indeed a masterpiece (be it maybe less so than the almost biblical hype surrounding it) and it does bring a beautiful, immersing and inspiring experience.  Really worth looking into.",
        "name": "So, what about Death Stranding?",
        "intro": "Love it or hate it, but Death Stranding is one of the most attention grabbing games of the year 2019 for sure. From the first trailer up until very close to release date (and for many people after that, still) this game has been surrounded by hype, mystery and wtf. According to Kojima fans it would turn out to be an innovative creation of genius that would change the gaming game. At the time of writing I haven’t finished it so this is not a review, but it’s more of a reflection on the game in the light of it’s hype. ",
        "images": [[{"title": "ds1", "text": "test1"}, {"title":"ds2", "text": "test2"}, {"title":"ds3", "text":"test3"}], [{"title": "ds2.1", "text": "test1"}, {"title":"ds2.2", "text": "test2"}, {"title":"ds2.3", "text":"test3"}]],
        "text": [["Early on in the days where there was nothing but short trailers featuring a baby in a pod Kojima mentioned the rope and the stick, mankind’s first inventions: one to hit whatever you don’t like, and the other to keep whatever you do like with you. At the time that was an “uuuuuhm, okay…? ” kind of explanation concerning the gameplay. And then it came out and it turned out that you do actually just carry stuff from one place to another. Of course there’s lots of complications and this and thats but in the most basic sense that is actually what you do in the game. When I just started playing I wasn’t too excited for that at all.\\nThen there’s this mission early in the game where you have to carry the corpse of an important person to an incinerator on a mountain (when you play the game you’ll know why a dude needs to carry a corpse to an incinerator on a mountain) and at some point this emotional music starts to play (of the kind which I usually hate) while you are making your way over these empty hills and at that moment the feeling of this game just clicked and I knew I was going to love it. It has this same feel of dramatic rebuilding of civilization in the wasteland, similar to for example Fallout games but in a different way. Soon you realize it’s not really about delivering stuff, but it’s about building connections between people and seeing the connected territory expand does feel very rewarding. "],
         ["The game is very cinematic and atmospherical, especially when playing with headphones.  You will grow attached to the little baby in the yellow pod you carry with you and you will feel intrigued and strangely endeared by flashes of a man played by Mads Mikkelsen trying to be a good dad for it. The music fits the theme and general style very well and I remember seeing an interview with Kojima some months before the release in which he mentioned that you can rest in your own private room and that it’s really cool and I had to laugh because I thought it didn’t sound cool at all, silly Kojima. But now I think it is. Putting on your favorite in-game song while watching Norman Reedus drinking a beer in his subterranean private room after hauling along 200+ kg’s of cargo through rough terrain feels just feels cozy.\\nSome of the early criticisms I have seen is that the big open world is too empty. And in some ways this is true. There’s few enemies who are usually found in certain spots only. There’s also little in terms of items to pick-up, NPC’s, towns or whatever; the world is indeed a mostly empty natural world. Surprisingly, I found this to be not boring but nice. I was actually growing somewhat tired of playing an open world game and constantly having the urge to check out every corner, look around for every conversation and do all the side-quests and find hidden items everywhere, and in Death Stranding there’s no need to do these things. The sooner you can get from A to B and just arrive where you want to go without detours, the better. I found this to be strangely liberating. \\nThe enemy, or rather the challenging element to conquer with your wits and skills, is the territory itself. If you are like me you will first run into the old habit of still beelining towards every objective, stubbornly mashing the climb button on steep cliffs, falling over & damaging your cargo a few times before you realize that it doesn’t work like that in this game. And then you will actually start out by examining the map, and looking around every so many meters to see whether your approach makes sense, and you will be arguing internally whether you should place that ladder now or take the long route and keep the ladder in case you need it later. Safely reaching your destination does feel good every time. Later on you will be able to build some structures (like a watchtower or a shelter) and even roads in the world."],
          ["The game’s most interesting feature however is the indirect multiplayer element. You will never encounter another player, but you can leave signs for others and most importantly you will be able to use some of the structures built by others in the world. It is unknown to me exactly what determines what structures form what players you can see, but as soon as you connect an area to the “chiral network” (this is a central element the game’s story progression, basically a sort of internet+ that places need to be connected to) you will start seeing signs and structures. And you can like them (as in, social media-style like something). \\nIt might feel a bit weird at first, but by the time I built my first road and seeing thousands of likes pouring in from player who travelled on them I realized the games most rewarding aspect. It’s really cool to both use things left for you by your internet bros who you don’t know and sending out some likes, and also to leave stuff in the right places to make life easier for them as well. You’ll not just looking around to see how you are going to get through an area, but also to see where you might construct something that will be the most useful for others.  Laying down a zip-line which connects to other ziplines made by online players and thus creating a network that saver everyone a shitton of time feels amazing. "]]},
        { "type":"articles", 
            "title":"state_of_the_games_industry",
            "subtitle": "Can there be too much?",
            "name": "The state of the games industry",
            "intro": ""},
        {"type":"reviews",
            "title": "Yakuza_0",
            "subtitle": "Streetfights, karaoke & hostess clubs",
         "name": "Yakuza 0",
         "intro": "",
         "score": "8",
         "conclusion": "Great stuff! gdffggggdhththt kjakjdhg  ygebfeaf iabwbfaefc aeaibfe",
         "gprating": 3.5,
         "strating": 4.0,
         "imrating": 3.5,
         "virating": 4.5,
         "images": [[{"title": "yakuza1", "text": "test1"}, {"title":"yakuza2", "text": "test2"}, {"title":"yakuza3", "text":"test3"}], [{"title": "yakuza2.1", "text": "test1"}, {"title":"yakuza2.2", "text": "test2"}, {"title":"yakuza2.3", "text":"test3"}]],
         "text": [["testestetetstetste"], ["yaddaydaydydyaydaa"], ["testestetetstetste"]]
        },
        {"type":"reviews",
        "title": "Dragon_Quest_XI",
        "subtitle": "As classic JRPG as it can get",
        "name": "Dragon Quest XI",
        "intro": ""}
    ]
}